; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/floortile/domain.pddl
;; updates:
;;   - :action-costs removed
;;   - movements updated to move_* to avoid repeating action and predicate names, e.g., up pred. with up act.
;;   - all action names use underscore

(define (domain floortile)
(:requirements :typing)
(:types robot tile color - object)

(:predicates
    (robot-at ?r - robot ?x - tile)
    (up ?x - tile ?y - tile)
    (down ?x - tile ?y - tile)
    (right ?x - tile ?y - tile)
    (left ?x - tile ?y - tile)
    (clear ?x - tile)
    (painted ?x - tile ?c - color)
    (robot-has ?r - robot ?c - color)
    (available-color ?c - color)
    (free-color ?r - robot))

(:action change_color
  :parameters (?r - robot ?c - color ?c2 - color)
  :precondition (and (robot-has ?r ?c) (available-color ?c2))
  :effect (and (not (robot-has ?r ?c)) (robot-has ?r ?c2))
)

(:action paint_up
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c))
)

(:action paint_down
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c))
)

; Robot movements
(:action move_up
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)

(:action move_down
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)

(:action move_right
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (right ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)

(:action move_left
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (left ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)

)

; problem
(define (problem floortile-35)
 (:domain floortile)
 (:objects 
    tile_0_1
    tile_0_2
    tile_0_3
    tile_0_4
    tile_1_1
    tile_1_2
    tile_1_3
    tile_1_4
    tile_2_1
    tile_2_2
    tile_2_3
    tile_2_4
    tile_3_1
    tile_3_2
    tile_3_3
    tile_3_4
    tile_4_1
    tile_4_2
    tile_4_3
    tile_4_4
    tile_5_1
    tile_5_2
    tile_5_3
    tile_5_4 - tile
    robot1 - robot
    white black - color
)
 (:init 
    (robot-at robot1 tile_2_4)
    (robot-has robot1 white)
    (available-color white)
    (available-color black)
    (clear tile_0_1)
    (clear tile_0_2)
    (clear tile_0_3)
    (clear tile_0_4)
    (clear tile_1_1)
    (clear tile_1_2)
    (clear tile_1_3)
    (clear tile_1_4)
    (clear tile_2_1)
    (clear tile_2_2)
    (clear tile_2_3)
    (clear tile_3_1)
    (clear tile_3_2)
    (clear tile_3_3)
    (clear tile_3_4)
    (clear tile_4_1)
    (clear tile_4_2)
    (clear tile_4_3)
    (clear tile_4_4)
    (clear tile_5_1)
    (clear tile_5_2)
    (clear tile_5_3)
    (clear tile_5_4)
    (up tile_1_1 tile_0_1 )
    (up tile_1_2 tile_0_2 )
    (up tile_1_3 tile_0_3 )
    (up tile_1_4 tile_0_4 )
    (up tile_2_1 tile_1_1 )
    (up tile_2_2 tile_1_2 )
    (up tile_2_3 tile_1_3 )
    (up tile_2_4 tile_1_4 )
    (up tile_3_1 tile_2_1 )
    (up tile_3_2 tile_2_2 )
    (up tile_3_3 tile_2_3 )
    (up tile_3_4 tile_2_4 )
    (up tile_4_1 tile_3_1 )
    (up tile_4_2 tile_3_2 )
    (up tile_4_3 tile_3_3 )
    (up tile_4_4 tile_3_4 )
    (up tile_5_1 tile_4_1 )
    (up tile_5_2 tile_4_2 )
    (up tile_5_3 tile_4_3 )
    (up tile_5_4 tile_4_4 )
    (down tile_0_1 tile_1_1 )
    (down tile_0_2 tile_1_2 )
    (down tile_0_3 tile_1_3 )
    (down tile_0_4 tile_1_4 )
    (down tile_1_1 tile_2_1 )
    (down tile_1_2 tile_2_2 )
    (down tile_1_3 tile_2_3 )
    (down tile_1_4 tile_2_4 )
    (down tile_2_1 tile_3_1 )
    (down tile_2_2 tile_3_2 )
    (down tile_2_3 tile_3_3 )
    (down tile_2_4 tile_3_4 )
    (down tile_3_1 tile_4_1 )
    (down tile_3_2 tile_4_2 )
    (down tile_3_3 tile_4_3 )
    (down tile_3_4 tile_4_4 )
    (down tile_4_1 tile_5_1 )
    (down tile_4_2 tile_5_2 )
    (down tile_4_3 tile_5_3 )
    (down tile_4_4 tile_5_4 )
    (left tile_0_1 tile_0_2 )
    (left tile_0_2 tile_0_3 )
    (left tile_0_3 tile_0_4 )
    (left tile_1_1 tile_1_2 )
    (left tile_1_2 tile_1_3 )
    (left tile_1_3 tile_1_4 )
    (left tile_2_1 tile_2_2 )
    (left tile_2_2 tile_2_3 )
    (left tile_2_3 tile_2_4 )
    (left tile_3_1 tile_3_2 )
    (left tile_3_2 tile_3_3 )
    (left tile_3_3 tile_3_4 )
    (left tile_4_1 tile_4_2 )
    (left tile_4_2 tile_4_3 )
    (left tile_4_3 tile_4_4 )
    (left tile_5_1 tile_5_2 )
    (left tile_5_2 tile_5_3 )
    (left tile_5_3 tile_5_4 )
    (right tile_0_2 tile_0_1 )
    (right tile_0_3 tile_0_2 )
    (right tile_0_4 tile_0_3 )
    (right tile_1_2 tile_1_1 )
    (right tile_1_3 tile_1_2 )
    (right tile_1_4 tile_1_3 )
    (right tile_2_2 tile_2_1 )
    (right tile_2_3 tile_2_2 )
    (right tile_2_4 tile_2_3 )
    (right tile_3_2 tile_3_1 )
    (right tile_3_3 tile_3_2 )
    (right tile_3_4 tile_3_3 )
    (right tile_4_2 tile_4_1 )
    (right tile_4_3 tile_4_2 )
    (right tile_4_4 tile_4_3 )
    (right tile_5_2 tile_5_1 )
    (right tile_5_3 tile_5_2 )
    (right tile_5_4 tile_5_3 ))
 (:goal (and 
(painted tile_5_1 white)
(painted tile_4_1 black)
(painted tile_3_1 white)
(painted tile_2_1 black)
(painted tile_1_1 white)
(painted tile_5_2 black)
(painted tile_4_2 white)
(painted tile_3_2 black)
(painted tile_2_2 white)
(painted tile_1_2 black)
(painted tile_5_3 white)
(painted tile_4_3 black)
(painted tile_3_3 white)
(painted tile_2_3 black)
(painted tile_1_3 white)
(painted tile_5_4 black)
(painted tile_4_4 white)
(painted tile_3_4 black)
(painted tile_2_4 white)
))
)

; plan
1. (move_up robot1 tile_2_4 tile_3_4)
   deleted: (robot-at robot1 tile_2_4) (clear tile_3_4)
   added: (robot-at robot1 tile_3_4) (clear tile_2_4)
   goals met: 0 of 19
2. (move_up robot1 tile_3_4 tile_4_4)
   deleted: (robot-at robot1 tile_3_4) (clear tile_4_4)
   added: (robot-at robot1 tile_4_4) (clear tile_3_4)
   goals met: 0 of 19
3. (change_color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 0 of 19
4. (paint_up robot1 tile_5_4 tile_4_4 black)
   deleted: (clear tile_5_4)
   added: (painted tile_5_4 black)
   goals met: 1 of 19
5. (move_left robot1 tile_4_4 tile_4_3)
   deleted: (robot-at robot1 tile_4_4) (clear tile_4_3)
   added: (robot-at robot1 tile_4_3) (clear tile_4_4)
   goals met: 1 of 19
6. (move_left robot1 tile_4_3 tile_4_2)
   deleted: (robot-at robot1 tile_4_3) (clear tile_4_2)
   added: (robot-at robot1 tile_4_2) (clear tile_4_3)
   goals met: 1 of 19
7. (paint_up robot1 tile_5_2 tile_4_2 black)
   deleted: (clear tile_5_2)
   added: (painted tile_5_2 black)
   goals met: 2 of 19
8. (change_color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 2 of 19
9. (move_left robot1 tile_4_2 tile_4_1)
   deleted: (robot-at robot1 tile_4_2) (clear tile_4_1)
   added: (robot-at robot1 tile_4_1) (clear tile_4_2)
   goals met: 2 of 19
10. (paint_up robot1 tile_5_1 tile_4_1 white)
   deleted: (clear tile_5_1)
   added: (painted tile_5_1 white)
   goals met: 3 of 19
11. (move_right robot1 tile_4_1 tile_4_2)
   deleted: (robot-at robot1 tile_4_1) (clear tile_4_2)
   added: (robot-at robot1 tile_4_2) (clear tile_4_1)
   goals met: 3 of 19
12. (move_right robot1 tile_4_2 tile_4_3)
   deleted: (robot-at robot1 tile_4_2) (clear tile_4_3)
   added: (robot-at robot1 tile_4_3) (clear tile_4_2)
   goals met: 3 of 19
13. (paint_up robot1 tile_5_3 tile_4_3 white)
   deleted: (clear tile_5_3)
   added: (painted tile_5_3 white)
   goals met: 4 of 19
14. (move_down robot1 tile_4_3 tile_3_3)
   deleted: (robot-at robot1 tile_4_3) (clear tile_3_3)
   added: (robot-at robot1 tile_3_3) (clear tile_4_3)
   goals met: 4 of 19
15. (move_right robot1 tile_3_3 tile_3_4)
   deleted: (robot-at robot1 tile_3_3) (clear tile_3_4)
   added: (robot-at robot1 tile_3_4) (clear tile_3_3)
   goals met: 4 of 19
16. (paint_up robot1 tile_4_4 tile_3_4 white)
   deleted: (clear tile_4_4)
   added: (painted tile_4_4 white)
   goals met: 5 of 19
17. (move_down robot1 tile_3_4 tile_2_4)
   deleted: (robot-at robot1 tile_3_4) (clear tile_2_4)
   added: (robot-at robot1 tile_2_4) (clear tile_3_4)
   goals met: 5 of 19
18. (change_color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 5 of 19
19. (paint_up robot1 tile_3_4 tile_2_4 black)
   deleted: (clear tile_3_4)
   added: (painted tile_3_4 black)
   goals met: 6 of 19
20. (move_left robot1 tile_2_4 tile_2_3)
   deleted: (robot-at robot1 tile_2_4) (clear tile_2_3)
   added: (robot-at robot1 tile_2_3) (clear tile_2_4)
   goals met: 6 of 19
21. (move_up robot1 tile_2_3 tile_3_3)
   deleted: (robot-at robot1 tile_2_3) (clear tile_3_3)
   added: (robot-at robot1 tile_3_3) (clear tile_2_3)
   goals met: 6 of 19
22. (paint_up robot1 tile_4_3 tile_3_3 black)
   deleted: (clear tile_4_3)
   added: (painted tile_4_3 black)
   goals met: 7 of 19
23. (move_left robot1 tile_3_3 tile_3_2)
   deleted: (robot-at robot1 tile_3_3) (clear tile_3_2)
   added: (robot-at robot1 tile_3_2) (clear tile_3_3)
   goals met: 7 of 19
24. (move_left robot1 tile_3_2 tile_3_1)
   deleted: (robot-at robot1 tile_3_2) (clear tile_3_1)
   added: (robot-at robot1 tile_3_1) (clear tile_3_2)
   goals met: 7 of 19
25. (paint_up robot1 tile_4_1 tile_3_1 black)
   deleted: (clear tile_4_1)
   added: (painted tile_4_1 black)
   goals met: 8 of 19
26. (change_color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 8 of 19
27. (move_down robot1 tile_3_1 tile_2_1)
   deleted: (robot-at robot1 tile_3_1) (clear tile_2_1)
   added: (robot-at robot1 tile_2_1) (clear tile_3_1)
   goals met: 8 of 19
28. (paint_up robot1 tile_3_1 tile_2_1 white)
   deleted: (clear tile_3_1)
   added: (painted tile_3_1 white)
   goals met: 9 of 19
29. (move_right robot1 tile_2_1 tile_2_2)
   deleted: (robot-at robot1 tile_2_1) (clear tile_2_2)
   added: (robot-at robot1 tile_2_2) (clear tile_2_1)
   goals met: 9 of 19
30. (move_up robot1 tile_2_2 tile_3_2)
   deleted: (robot-at robot1 tile_2_2) (clear tile_3_2)
   added: (robot-at robot1 tile_3_2) (clear tile_2_2)
   goals met: 9 of 19
31. (paint_up robot1 tile_4_2 tile_3_2 white)
   deleted: (clear tile_4_2)
   added: (painted tile_4_2 white)
   goals met: 10 of 19
32. (move_down robot1 tile_3_2 tile_2_2)
   deleted: (robot-at robot1 tile_3_2) (clear tile_2_2)
   added: (robot-at robot1 tile_2_2) (clear tile_3_2)
   goals met: 10 of 19
33. (change_color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 10 of 19
34. (paint_up robot1 tile_3_2 tile_2_2 black)
   deleted: (clear tile_3_2)
   added: (painted tile_3_2 black)
   goals met: 11 of 19
35. (move_down robot1 tile_2_2 tile_1_2)
   deleted: (robot-at robot1 tile_2_2) (clear tile_1_2)
   added: (robot-at robot1 tile_1_2) (clear tile_2_2)
   goals met: 11 of 19
36. (move_left robot1 tile_1_2 tile_1_1)
   deleted: (robot-at robot1 tile_1_2) (clear tile_1_1)
   added: (robot-at robot1 tile_1_1) (clear tile_1_2)
   goals met: 11 of 19
37. (paint_up robot1 tile_2_1 tile_1_1 black)
   deleted: (clear tile_2_1)
   added: (painted tile_2_1 black)
   goals met: 12 of 19
38. (change_color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 12 of 19
39. (move_down robot1 tile_1_1 tile_0_1)
   deleted: (robot-at robot1 tile_1_1) (clear tile_0_1)
   added: (robot-at robot1 tile_0_1) (clear tile_1_1)
   goals met: 12 of 19
40. (paint_up robot1 tile_1_1 tile_0_1 white)
   deleted: (clear tile_1_1)
   added: (painted tile_1_1 white)
   goals met: 13 of 19
41. (move_right robot1 tile_0_1 tile_0_2)
   deleted: (robot-at robot1 tile_0_1) (clear tile_0_2)
   added: (robot-at robot1 tile_0_2) (clear tile_0_1)
   goals met: 13 of 19
42. (move_up robot1 tile_0_2 tile_1_2)
   deleted: (robot-at robot1 tile_0_2) (clear tile_1_2)
   added: (robot-at robot1 tile_1_2) (clear tile_0_2)
   goals met: 13 of 19
43. (paint_up robot1 tile_2_2 tile_1_2 white)
   deleted: (clear tile_2_2)
   added: (painted tile_2_2 white)
   goals met: 14 of 19
44. (move_right robot1 tile_1_2 tile_1_3)
   deleted: (robot-at robot1 tile_1_2) (clear tile_1_3)
   added: (robot-at robot1 tile_1_3) (clear tile_1_2)
   goals met: 14 of 19
45. (move_up robot1 tile_1_3 tile_2_3)
   deleted: (robot-at robot1 tile_1_3) (clear tile_2_3)
   added: (robot-at robot1 tile_2_3) (clear tile_1_3)
   goals met: 14 of 19
46. (paint_up robot1 tile_3_3 tile_2_3 white)
   deleted: (clear tile_3_3)
   added: (painted tile_3_3 white)
   goals met: 15 of 19
47. (move_down robot1 tile_2_3 tile_1_3)
   deleted: (robot-at robot1 tile_2_3) (clear tile_1_3)
   added: (robot-at robot1 tile_1_3) (clear tile_2_3)
   goals met: 15 of 19
48. (move_right robot1 tile_1_3 tile_1_4)
   deleted: (robot-at robot1 tile_1_3) (clear tile_1_4)
   added: (robot-at robot1 tile_1_4) (clear tile_1_3)
   goals met: 15 of 19
49. (paint_up robot1 tile_2_4 tile_1_4 white)
   deleted: (clear tile_2_4)
   added: (painted tile_2_4 white)
   goals met: 16 of 19
50. (change_color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 16 of 19
51. (move_left robot1 tile_1_4 tile_1_3)
   deleted: (robot-at robot1 tile_1_4) (clear tile_1_3)
   added: (robot-at robot1 tile_1_3) (clear tile_1_4)
   goals met: 16 of 19
52. (paint_up robot1 tile_2_3 tile_1_3 black)
   deleted: (clear tile_2_3)
   added: (painted tile_2_3 black)
   goals met: 17 of 19
53. (move_down robot1 tile_1_3 tile_0_3)
   deleted: (robot-at robot1 tile_1_3) (clear tile_0_3)
   added: (robot-at robot1 tile_0_3) (clear tile_1_3)
   goals met: 17 of 19
54. (move_left robot1 tile_0_3 tile_0_2)
   deleted: (robot-at robot1 tile_0_3) (clear tile_0_2)
   added: (robot-at robot1 tile_0_2) (clear tile_0_3)
   goals met: 17 of 19
55. (paint_up robot1 tile_1_2 tile_0_2 black)
   deleted: (clear tile_1_2)
   added: (painted tile_1_2 black)
   goals met: 18 of 19
56. (change_color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 18 of 19
57. (move_right robot1 tile_0_2 tile_0_3)
   deleted: (robot-at robot1 tile_0_2) (clear tile_0_3)
   added: (robot-at robot1 tile_0_3) (clear tile_0_2)
   goals met: 18 of 19
58. (paint_up robot1 tile_1_3 tile_0_3 white)
   deleted: (clear tile_1_3)
   added: (painted tile_1_3 white)
   goals met: 19 of 19
